[
  {
    "title": "My Haba Snow Mountain Journey",
    "file": "my-haba-snow-mountain-journey.en.html",
    "markdown": "my-haba-snow-mountain-journey.en.md",
    "html_content": "<h1>My Haba Snow Mountain Journey</h1>\n<p>translation: GPT-5.2</p>\n<p><em>(This article is about 11,600 Chinese characters long and is written entirely by a human. If it feels too long, you can jump straight to the AI Bonus section at the end.)</em></p>\n<p>I’m in Kunming now. I’ve just finished washing every piece of gear I brought back from the summit. Before the memory gets “washed out” too much as well, I want to pour it all out while it’s still fresh.</p>\n<p>2025.10.02</p>\n<h3>Timeline</h3>\n<ul>\n<li>09.20 Confirmed the plan with a friend and bought flights</li>\n<li>09.29 22:00 Flew direct and arrived in Lijiang</li>\n<li>09.30 06:00 Drove to Haba Village, then rode mules to Base Camp</li>\n<li>10.01 03:00 Set off, 09:30 reached the summit, 14:30 back to Base Camp; rode mules back to Haba Village; drove back to Lijiang</li>\n</ul>\n<h3>Pre-trip prep</h3>\n<p>My prep had three main parts: itinerary, gear, and fitness. All three are worth talking about.</p>\n<p><strong>Itinerary.</strong> Because there’s a daily quota for climbers, we had to compress the trip into two days and one night at the last minute. That made everything extremely tight, and we lost a night in Haba Village for rest and acclimatization. For that reason we decided early on to ride mules instead of hiking from Haba Village to Base Camp and back. Flights were surprisingly cheap: Hong Kong Airlines HK412, total 753 HKD for a direct flight from Hong Kong to Lijiang.</p>\n<p><strong>Gear.</strong> There was a lot to prepare, and since it was my friend’s first snow mountain, I had to cover a bit more too. The gear came from multiple places: some older equipment had to be mailed from my hometown; some gear and most consumables were from Taobao (a Chinese e-commerce marketplace); some were bought via Hong Kong online shops; and some critical items had to be tried on and picked in physical stores. The packing list kept changing because I was constantly reading posts on Xiaohongshu / RED (a Chinese social app) and revising my understanding.</p>\n<p>Shipping also got tricky. During the days I was adding items to the cart, the forecast for Typhoon Yagi became clearer and clearer (it eventually triggered Hong Kong’s highest tropical cyclone warning, the “No. 10 signal”). I judged that forwarding goods from mainland China to Hong Kong carried a large risk. The workaround was: book a hotel in Lijiang first, then ship everything in mainland China directly to that hotel. In the end the hotel received 10 packages in total: 8 arrived intact, 1 got damaged and took in water (but the contents were mostly fine), and 1 went missing. The whole thing was basically a stress test for the hotel. I’m genuinely grateful to the front-desk staff and couriers for all the calls and WeChat (messaging app) back-and-forth—and they wouldn’t even take a red packet (a customary cash tip/gift). The downside was that it massively increased the workload once I reached the hotel.</p>\n<p>Looking back, even with all that effort there were still gaps—some things I brought too much of, some things I still lacked—but thankfully the most critical parts were fine, and overall the gear held up.</p>\n<p><strong>Fitness.</strong> Since I needed to leave one or two days for recovery right before the trip, I really only had seven days to prep, and those days were also interrupted by itinerary and gear tasks. Based on Xiaohongshu guides—and factoring in the typhoon and convenience—my fitness plan ended up being very simple:</p>\n<ol>\n<li>Protect sleep: try to sleep before midnight</li>\n<li>Prevent my old knee injury from flaring up: take glucosamine and vitamin D daily</li>\n<li>Build climbing endurance: climb stairs</li>\n</ol>\n<p>How it went:</p>\n<p>For sleep, I mostly slept around midnight every day, except one day when I went to bed after 2 a.m.</p>\n<p>I did stair training 5 times in total. The method: climb from the ground floor to the top, take the elevator back down, then climb again—no downhill training. The main reason was that I worried my knee wouldn’t recover, or would fail early (a painful lesson from an earlier trip to Dafeng Peak on Siguniang Mountain). Excluding the time spent in the elevator, each session was around 30 minutes. Afterwards I took CoQ10, and used a mix of heat, electrical stimulation, and massage/strength work to speed up full-body recovery. Each session was roughly 100 floors, about 300 meters of vertical gain—enough to meet the baseline I saw in some Xiaohongshu posts and to build an initial layer of confidence.</p>\n<p>It was my first time doing stair training, and the worst part was switching between the stairwell and the building: after sweating through a dozen-plus floors, you step into the hallway and elevator, and Hong Kong’s standard, “electricity-is-free” air conditioning blasts you from every angle until your hair stands up. So I had to carry a hooded jacket and keep putting it on and taking it off. The upside is that the elevator ride down provides a reasonable rest interval. And the stuffy air in the stairwell, while miserable, does simulate high-altitude breathing to some extent.</p>\n<p>From a project management perspective, the three prep streams were interdependent and cross-cutting—it was a non-trivial project. Thankfully the “team” was simple: just me and one friend. With WeChat communication plus a kanban board in Obsidian (mainly to track gear), I managed to keep the complexity under control.</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230544_23_88.jpg\" /></p>\n<h3>Day 0 Hong Kong → Lijiang (0–2400m)</h3>\n<p>I arrived at Lijiang airport after 10 p.m. By 23:15, after getting to the hotel, I spent the rest of the night hunting down packages, opening them, and sorting gear (reallocating and compressing what I’d take to Haba Village; leaving excess items stored at the hotel). I didn’t get into bed until after 1 a.m. Since I had to wake up early to head to Haba Village the next day, I only slept 4.5 hours.</p>\n<h3>Day 1 Lijiang → Haba Village → Base Camp (2400–4100m)</h3>\n<p>We set off at 6 a.m. I ate the breakfast my friend had ordered in advance on the car. I’d hoped to nap, but I stayed awake because I wanted to watch the scenery. It was overcast the whole way. We drove past Tiger Leaping Gorge; even through clouds and mist it looked beautiful. We didn’t stop, but it still felt like a quick preview—one day I’ll come back properly.</p>\n<p><img alt=\"Looking back at Tiger Leaping Gorge\" src=\"assets/images/Image_20260120230131_1_88.jpg\" /></p>\n<p>We reached the village around 8:30. It was drizzling, and I wasn’t feeling great—slightly dizzy. I thought: ok, here we go again. Another round in the fight against altitude sickness.</p>\n<p>At the club, I drank a cup of fresh yak butter tea made by an older uncle, warmed up by the fire for a bit, and felt better. I repacked again: filled my thermos with a full cup of butter tea; put on my three-layer system and rain poncho; carried most of the rest on my back; and put a small portion into a woven sack (in hindsight, why not put most of it there? Maybe because a sack hanging on the side of a mule could make it unbalanced). Then I got on the mule, and the Haba Snow Mountain trip officially began.</p>\n<p><img alt=\"Butter tea\" src=\"assets/images/Image_20260120230133_2_88.jpg\" /></p>\n<p>The mule trail is different from the hiking route, but the scenery is still great. A cold but not heavy rain kept falling. We moved through thin fog in the forest, bumping upward through mud. Most of the time there were no people besides us; occasionally we saw cattle and sheep. Only at a mid-way rest stop did we briefly cross paths with hikers. You can imagine how hard hiking must be in rain, fog, and mud like this. This segment gained about 1,200 meters in elevation.</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230140_3_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230144_4_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230154_5_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230156_6_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230158_7_88.jpg\" /></p>\n<p>After being jolted around until my senses went numb, I felt a burst of joy when the sharp outline of Base Camp finally appeared out of the fog. I hurried off the mule and walked in, only to discover Base Camp was larger than I’d imagined—quite lively, and it even had a small shop.</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230203_10_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230205_11_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230207_12_88.jpg\" /></p>\n<p>I spent the entire afternoon and first half of the night at Base Camp. A few observations:</p>\n<ol>\n<li>\n<p>Base Camp’s lodging was actually pretty good. The room I stayed in was cramped—outside of four bunk-bed frames, there were only three to four square meters of free space. Eight men in one room; it felt like going back to a student dorm. There wasn’t trash left behind, the bedding was wrapped in disposable plastic film, and the smell wasn’t strong—basic hygiene was there. There were power strips, but you need your own extension cord. The camp claimed to have Wi-Fi; some people said it worked. But neither my iPhone nor my OPPO could connect. There was no mobile signal on the mountain, and my friend was in the women’s dorm, so I was basically cut off from the outside world.\n  <img alt=\"\" src=\"assets/images/Image_20260120230200_8_88.jpg\" /></p>\n</li>\n<li>\n<p>If I had to give a bad review, besides the network it would be the ground. The “ground” was basically not ground: imagine a wide field of gelatinous mud, more than ten centimeters deep, with a fishy stench, scattered with stones that might be natural or might be human-placed—that was it. Walking around camp, you had to make sure every step landed precisely on a stone; otherwise you’d gain +1 “stepping-in-poop” sensation. In half a day I must have hit +7 or +8. My shoes became increasingly unrecognizable. It might be much better on a dry day, but by the time we arrived it had already been raining for days.</p>\n</li>\n<li>\n<p>Food, drink, and bathroom. The food was honestly good enough to deserve praise. Base Camp has multiple separate dining halls; which one you go to depends on your club’s arrangement. The one I went to was decent: both dinner and breakfast were buffet-style—meat, vegetables, rice, soup—quite rich; enough oil and salt; flavor was fine. The toilets were basically classic pit toilets. Even for what’s said to be the cleanest toilet in camp, don’t bring any unrealistic expectations.\n  <img alt=\"\" src=\"assets/images/Image_20260120230202_9_88.jpg\" /></p>\n</li>\n<li>\n<p>Health check and briefing. Everyone had to do a simple blood pressure and blood oxygen check after arriving in the afternoon. Blood pressure was measured through an outer jacket; blood oxygen was with a finger clip. When I took mine I glimpsed a number “74 (?)”—I suspect what I saw was heart rate. It was a bit perfunctory, but at least they went down a name list one by one. After everyone arrived and checks were done, the briefing started. This part had real content. The guides covered safety and how to use the gear distributed afterwards: helmet, ice axe, harness + safety rope, and crampons. They especially emphasized: don’t let your helmet and ice axe leave your body; on dangerous sections of Despair Slope you must use the safety system together with the newly refurbished fixed rope; and don’t take any meds casually (including glucose), because the assistants (and you yourself) won’t be able to assess your condition accurately—and in worse cases, medication can exacerbate altitude symptoms.</p>\n</li>\n</ol>\n<p>There’s a lot to say about these mandatory pieces of equipment.</p>\n<ul>\n<li>\n<p>Helmet: your headlamp needs to clip onto it. Helmets don’t seal well, so they don’t block wind and water well. It’s better not to use it as the outermost layer. My setup that day: wool beanie on the inside, then helmet, then the hood of my rain poncho. My hardshell jacket was under the rain poncho. It had a hood, but it wasn’t designed to fit over a helmet, so I had to use the rain poncho hood as the outermost layer—tight, and not very comfortable.</p>\n</li>\n<li>\n<p>Ice axe: an extremely useful piece of equipment. On the way up it can be used like a walking axe to leverage; during breaks it can support your body; above the snow line it can save your life by arresting a slide. But as for actual self-arrest technique, the afternoon briefing didn’t go into detail. We didn’t even have ice axes in hand during the explanation, and there was no practice. From personal experience, when you actually fall, you basically can’t react fast enough. Still: I strongly recommend never letting go, especially above the snow line—letting go is a huge risk (see the tragedy that happened recently on Nama Peak / 那玛峰).</p>\n</li>\n<li>\n<p>Crampons: about as important as the ice axe. Without crampons, you simply can’t move on icy scree sections and the snowy parts of Despair Slope. A few years ago when I climbed Dafeng Peak (Siguniang Mountain), I used a cheap set of simple crampons with short teeth that I bought myself. This was my first time using a more professional set with long teeth—really like claws. The downsides are many: heavy; very annoying to put on (mostly annoying for the assistants); and there are safety risks (if your feet cross, the crampons can lock together and you fall—again, see the Nama Peak tragedy). But overall, the benefits are even greater, and I’ll mention them later.</p>\n</li>\n<li>\n<p>Harness + safety rope: a set of gear that’s hard to put on. Official guidance requires using it on Despair Slope, but in reality I saw basically no assistant making anyone use it. You’re even far from the fixed rope on about half of the slope. My guess: for every short segment, an ascender needs to be unlocked and locked; most climbers are beginners and likely need an assistant’s help, which is too slow and time-consuming. Also, above the snow line there are hidden holes and traps under the snow; compared to the fixed-rope line, assistants will prefer routes that people have already packed down and made safer, or routes they’re more familiar with. For me, this safety system only really mattered on the steepest section when descending from the summit: the assistant held the rope to prevent me from sliding away, and I could also pull for extra leverage.</p>\n</li>\n</ul>\n<p>These mandatory items together probably weigh around 5 kg (about 10 jin; 1 jin ≈ 0.5 kg). If you carry your own pack on summit day, that weight is yours. If the assistant carries it, the only weight you can really save is roughly the weight of one set of crampons.</p>\n<p>Since we’re talking gear, here’s the full clothing and equipment I carried during the summit push:</p>\n<p>Upper body: quick-dry base layer, fleece, down puffer, hardshell, long rain poncho\nLower body: quick-dry pants, fleece, shell pants, gaiters\nHands: two pairs of thin waterproof outdoor gloves, one pair of thick ski gloves\nFeet: two pairs of outdoor socks, two pairs of long wool socks, high-cut waterproof hiking boots, crampons\nHead: wool beanie, fleece balaclava, sunglasses, headlamp, helmet</p>\n<p>Two details are worth highlighting:</p>\n<ul>\n<li>\n<p>Long rain poncho: not a cheap disposable one; a Decathlon poncho that cost 200+ RMB. It was the dark-horse MVP of this trip. During prep I kept it low priority. First, my shell jacket and pants have decent waterproofing, so the poncho felt less important; second, it doesn’t compress very small, so it takes space. On past trips to Yubeng and Dafeng Peak, the weather was sunny while hiking, so I never learned this lesson deeply. Before heading to Haba Village, I almost left it stored in Lijiang. But in reality, across the entire two days and one night, it was almost constantly raining or snowing. The shells were under huge waterproofing pressure. The poncho helped a lot and served as my outermost layer the whole time.</p>\n</li>\n<li>\n<p>Socks + boots + gaiters + crampons: I’ll group these lower-body items together. Crampons are annoying to take on and off; once you put them on, you really don’t want to take them off mid-route. So when would you have to? When you need to change socks. The combined snow/water protection of boots + gaiters + crampons still can’t beat sustained rain and snow. Your socks will get soaked; your boots will take in water. The added weight is secondary. The bigger problem is heat loss and frostbite. While you’re moving during the summit push and the return to Base Camp, your feet generate plenty of heat. But once you’re back at Base Camp, you can change socks—yet if your boots are soaked, they won’t dry easily. Then if you go further down to the village and choose to ride a mule (most people do), your feet hang still for two or three hours. In low temperatures, wet boots turn into slow, steady damage-over-time. Later, during my “make-up lessons,” I learned a simple upgrade: wrap your feet in plastic wrap. You sacrifice breathability in exchange for waterproofing.</p>\n</li>\n</ul>\n<p>Back to that afternoon at Base Camp: after dinner and collecting gear, it was already past 6 p.m., and it was fully dark. After organizing summit gear, the only real task was rest. But rest wasn’t easy—two difficulties: time and altitude. Standard summit departure is 3 a.m., meaning you need to get up around 2. In the best case, you fall asleep immediately and sleep until 2—but that’s far from our usual circadian rhythm. And although altitude affects people differently, above 4,000 meters very few people feel nothing. That makes sleep much harder. For altitude prevention/relief, everyone agrees on one thing: drink water. Hydration helps metabolism and acclimatization, but drinking water means peeing. The nearest toilet was dozens of meters away; walking over pitch-black mud was miserable. So how much water to drink before sleep became a dilemma.</p>\n<p>Maybe there’s no such thing as an easy high-altitude night. My memory goes like this: I lay down at 7:30 and closed my eyes. I drifted into a half-sleep quickly. I woke up thinking I’d slept a long time—then checked my watch: only 9:30. After that I couldn’t fall asleep again. The faint headache I’d had became obvious, and my watch’s oxygen saturation and heart rate numbers looked ugly. For warmth the dorm door was closed. A group of men + a small room means oxygen only decreases. For the next few hours, I fell into the classic loop of a headache-induced insomnia: keep trying to fall asleep, keep checking the time/heart rate/SpO₂, keep observing how others were doing—some people were actually snoring. Others were tossing and turning too. Some opened the door to “get oxygen,” then shut it again because of the cold wind, cycling up and down like taking turns on a stage. Bit by bit, those hours were ground down.</p>\n<h3>Day 2 Haba Snow Mountain (4100–5396–4100m)</h3>\n<p>Around 1 a.m., a sudden noise rose from outside. Listening closely, it sounded like heavy rain. I thought: well, the difficulty slider just got pushed higher again. Thankfully it eased up around 2. Almost everyone woke up earlier than scheduled, because sleep was so bad. When the room was finally noisy and someone turned on the light, I felt a kind of relief—at least I didn’t have to keep trying and failing. Someone said: “Seeing everyone doing this badly makes me feel reassured.” A guy from the Northeast who had hiked up from the village decided to give up on the summit right away.</p>\n<p>I was in terrible shape too—my head hurt and felt swollen, extremely uncomfortable. I was seriously thinking of bailing. I forced myself to the dining hall, but I couldn’t eat anything; I managed a few bites of pickles and half a bowl of rice porridge. I filled my thermos with hot water and went back to the dorm. Sitting on the bed, I checked each item I needed to carry, waiting for my assistant.</p>\n<p>While waiting, I decided: don’t think about anything; just start walking and see.</p>\n<p>If so, then do whatever increases the probability of summiting. When I picked up my packed backpack and felt the 10+ kg weight, I almost immediately asked the assistant to carry it for me (money does help).</p>\n<p>The moment I stepped outside, I pressed start on my watch to record the hike. Looking back later, that moment was 2:59.</p>\n<p>Looking uphill, I could already see many wavering dots of light in the dark—lots of people had started early. I’d seen a similar scene at Dafeng Peak before, except that time we camped above Base Camp by 200 meters, so those lights were below us at departure. This time, I didn’t feel that first-time excitement. Experience really is a double-edged sword.</p>\n<p>The rain stayed as light drizzle, and I wore my rain poncho, so it wasn’t a hard deterrent. From here it was only one job: go up. As I walked, I slowly drank a small can of Red Bull; the caffeine helped keep me awake after two nights of poor sleep. My assistant didn’t talk much. He’d wait slightly ahead or slightly behind me, which was perfect. I moved forward in silence. A couple of times I asked what time it was; he’d reply with something like “at this time we’re only at X…” I didn’t calculate carefully, but I figured we still had some margin before the cut-off time. So I kept going. The goal was clear: only stop when I absolutely had to.</p>\n<p>Darkness, tangled headlamps, fine rain, cold wind, sweat, the sound of heavy breathing—keep going up. At some point I realized my head didn’t hurt as much as before—keep going up. Without noticing, the front got darker, and the lights behind became more numerous—keep going up.</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230208_13_88.jpg\" /></p>\n<p>As people say, Haba’s summit push is really just nonstop uphill—almost no flat ground (4 km with 1,300 m gain). Beyond physical endurance, the challenge was cold rain and stronger wind the higher we went. When we reached the wind-shelter hut around 4,500 m, I started to shiver; the threat of hypothermia was very real. Even with a poncho and hardshell, my fleece was already half wet, though I couldn’t tell whether it was mostly outside-in or inside-out. The hut was packed with people changing clothes. At my assistant’s suggestion, I took off my shell and fleece, pulled my down puffer from the pack, put it on as an inner layer to trap heat, wore the fleece outside the down, and then put the shell back on. It’s kind of the reverse of the usual order, but it worked great—I stopped feeling cold quickly. Without it, I probably would have retreated right there. Later I learned that many people did, in fact, turn back around that area.</p>\n<p>After changing, we went outside to find a relatively sheltered spot to refuel. Right then, I realized the thermos that had been stuck into the side pocket of my backpack was gone. Luckily, the assistant let me drink his hot water.</p>\n<p>Keep going up. The sky began to lighten. Keep going up. The big rock slabs turned into a field of loose rocks.</p>\n<p>The assistant found a sheltered spot, took off the backpack, and asked me to pull out my crampons. He told me to eat and drink enough and then leave the backpack behind. Only then did I realize: ah, we’re at that stage already. The coldness smacking my cheeks became more tangible—it was rain mixed with snow.</p>\n<p>This is the turning point of the whole route, probably called the scree slope: the technical section starts here. Compared to the earlier monotonous uphill, this part was genuinely fun. I’d describe it as a kind of parkour where crampons, ice axe, hands, and feet are all used—like a jumping game. Crampons are both love and hate. I quickly learned firsthand what it means for crampons to lock together when your feet cross (again: the Nama Peak tragedy). The hem of my long poncho also risked being stepped on. But beyond those annoyances, the feeling crampons gave me was: power. Those complex, interlocking boulders—you can actually walk straight over them. Snow and thin ice on the rocks clearly recorded the tooth marks left by my assistant and the people before him (who were already out of sight), so you know someone has been there, but you still can’t quite believe it: what, you can step on that angle? The body convinces the mind before the mind agrees.</p>\n<p>Maybe because it was interesting, this segment felt like it passed quickly. Jump-jump, and suddenly there were no more rocks ahead—only a vast white expanse. Despair Slope began. At this point I felt I’d reached a stamina bottleneck. Still the same: don’t think about anything; take as many steps as you can; keep going until you have to turn around.</p>\n<p>Why is it called “Despair Slope”?</p>\n<ul>\n<li>Gradient: around 45 degrees, requires real control of your center of gravity</li>\n<li>Terrain: a snow slope. In October it felt like 20–30 cm of snow; uneven thickness; the top layer is looser and hard to stand firmly on. Snow covers the underlying terrain; hidden holes and cracks are dangerous. Some sections get packed by many feet and “mines” get cleared, but the surface also becomes more slippery.</li>\n<li>Gain: from 4,900 to 5,300 m—400 m of climbing. Combine altitude, gradient, and terrain, and this is absolutely not an ordinary 400 m.</li>\n</ul>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230212_16_88.jpg\" /></p>\n<p>Snow slapped my face chaotically. I didn’t wear ski goggles; instead I had clip-on sunglasses over my prescription glasses. The lenses stayed blurred; I could barely see the path under my feet. Looking left and right, everything was a thick gray-white; visibility maybe tens of meters. Every upward step required kicking hard into the snow, stabilizing with crampons, planting the ice axe into the snow ahead, leaning my weight onto it, and then taking the next step. Axe in, left foot, right foot, stop—bend low for a breath—repeat. I fell several times because the snow wasn’t compacted, or because my crampons locked. With snow attacking from the ground and from the air, even with the poncho and other gear, my gloves (I’d already switched to the last pair) and boots were soaked. I could clearly feel the fabric swelling from absorbed water in both hands and feet.</p>\n<p>As stamina drained, I had to stop after seven or eight steps, then five or six steps, resting in that bent-over, hands-on-axe posture to breathe. Lack of water was another big problem: both my water and my assistant’s water were left at the scree slope and we didn’t bring them up. I was so thirsty my mouth tasted bitter. Later I seriously considered stuffing a mouthful of untouched snow, but I didn’t know whether my throat and stomach could handle it. Fortunately, near the summit there were more people again. I saw a guy with a bottle of Coke on his pack. I asked him and he said he also had a bottle of water in his bag, and he let me gulp a few mouthfuls. Ice-cold life itself! He offered to give me the whole bottle; I refused and told him that water is far too precious in a place like this—no matter what, it’s better he keeps it.</p>\n<p>Another thing I’m grateful for: my assistant had a very “introvert” vibe. Unlike some stories online, he didn’t drag or pull me step by step. He just demonstrated and led, letting me feel it and grind it out myself. He did get increasingly sharp-tongued (“Focus and walk properly.” “How did you mess your crampons up like this? Can’t fix it—fine, just like this.” “Stop talking to me, walk faster, get to the top and then you’ll be impressive.” “How can you be that thirsty? We’ve done this so many times, we know it well…”), but he never once urged me to retreat.</p>\n<p>Finally I heard people ahead saying they could see the sign, that someone was taking photos. I looked up. All I could see was a small, blurry shadow in the upper-left of my vision. They said there were only a few steps left. But I still couldn’t move. And yet, step by step, I dragged myself up.</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230209_14_88.jpg\" /></p>\n<p>On the summit it was still a blur, and the wind and snow were even stronger. Taking photos was unbelievably fast. A few minutes of panting in a short queue; then I put down the ice axe, took off the helmet, put on the commemorative badge, handed my phone to the assistant, click-click, two shots done, phone back into the pocket. I didn’t even have the energy to point the camera anywhere else beyond the summit marker (and in the fog there wasn’t much to shoot anyway). The timestamp on the photo was 09:31. From 3 a.m. to 9:30 a.m.—a clean 6.5 hours.</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230213_17_88.jpg\" /></p>\n<p>Summiting is only half the job. The problem in front of you is “getting back.” The freezing wind and snow, the severely depleted stamina, and my knee injury that could flare up at any time—all these threats killed any desire to linger and savor.</p>\n<p>The eternal truth is: going up is easy; going down is hard. I descended Despair Slope, tumbling and scrambling the whole way. The ice axe helped less; my legs went soft. I slipped constantly. I fell backwards onto my butt; I slid forwards with both feet losing control and shooting several meters. The idea of “stomping your heels into the snow” felt like superstition: whenever your other foot hasn’t stepped down yet, you can’t be sure whether the current foot is really secure. I’d describe it as the snow negotiating with your feet. If the answer is “no,” you will inevitably fall. My assistant complained nonstop—and in the end, he slipped once or twice too.</p>\n<p>On the most dangerous section, he held my safety rope and I grabbed it too, and we stumbled down like that—half human, half dog. Gradually I got a bit of downhill technique: don’t stare at your feet in fear of missing a step. Look farther away, and let your body sense and control the movement (maybe that also shifts your center of gravity slightly back).</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230210_15_88.jpg\" /></p>\n<p>Even after a long time, looking far ahead I still couldn’t see the end of the slope. In the final section, perhaps because a small patch of sunlight filtered down, and because I was exhausted, I felt extremely sleepy—my assistant started yawning too. We could only hurry down; otherwise it would get more dangerous.</p>\n<p>Finally we were back on the rock-strewn scree slope. By then I was at my limit. And because we were going down, a place that felt quick on the way up now felt bizarrely hard. Eventually we reached where we’d left the gear. I drank a few big gulps of water that had already begun forming icy slush, and took off the crampons.</p>\n<p>Following my assistant’s suggestion, I took off my fully soaked gloves and tucked my hands into my poncho sleeves to warm them (I was skeptical, but it worked). Then we kept going down.</p>\n<p>Once we were on a section without snow, I handed my ice axe to the assistant to carry. Then I pulled out my secret weapon (in video-game terms: an “S-rank” item): trekking poles. For the first time I truly felt trekking poles = happiness. With poles, for no clear reason, strength started flowing back—maybe because the familiar rhythm of regular hiking returned. Even though the assistant walked faster and faster, I could keep up closely, and I finally had spare energy to take out my phone and shoot a few photos.</p>\n<p>On the way I met another assistant. Seeing me walking with such glee, he half-intentionally led me onto harder terrain to “challenge” me, which escalated into a big slope where he wanted me to run down… and of course, my knee finally started hurting. But for it to only start hurting here meant it had performed at 300% that day. My stomach started to reflux in waves and I felt an impending bout of diarrhea; I forced it down with water. Base Camp was already visible to the naked eye, yet it still took forever to reach.</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230218_20_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230215_18_88.jpg\" /></p>\n<p>In the later segment, my assistant surged ahead and gradually pulled tens of meters away. But eventually he slowed down and was willing to chat a bit. It turned out he wasn’t local to Haba; he was from elsewhere in Yunnan. He used to hike a lot, and later turned it into work to make money. He explained that he’d been trying to motivate me with “provocation” earlier—he didn’t truly think I was that bad—and that he thought I had a lot of grit. He also said the weather was bad that day, but we still made it up.</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230216_19_88.jpg\" /></p>\n<p>We kept walking and walking, and finally reached Base Camp. It was 14:30. Another clean number. The Haba hike totaled 11.5 hours.</p>\n<h3>The way back (4100–2400–1900–0)</h3>\n<p>Base Camp was quiet by then. Most people had already left. Based on the assistants’ estimate that day and what I later gathered from Xiaohongshu, the summit success rate was around 15%–20%—roughly 45–60 people out of 300. Those who had retreated early to Base Camp had already continued down.</p>\n<p>There was no phone signal, and I couldn’t contact my friend. I hadn’t seen her since after dinner the night before, and I had no idea how she was doing. After returning the gear, I asked around but got nowhere. Someone suggested I go warm up in the little shop. It was packed with summit returnees. I finally squeezed into a corner and warmed my gloves for a bit, then went back to the dorm, changed into a dry pair of socks, and started packing.</p>\n<p>The dorm floor was a mess—footprints everywhere, trash everywhere. Only then did I discover my thermos was lying safely on my bed. So it must have slipped off my backpack when I set off because I hadn’t tied it down. Another huge lesson.</p>\n<p>At this moment, the guy on the bunk opposite came in. After a few lines of chat, I learned he hadn’t summited. I was surprised—when we talked the night before, I knew he had more experience, and he was physically solid too. I guessed he probably burned too much energy during the Day 1 hike; two rainy days on Haba are much higher intensity. He was also surprised that I’d made it, since anyone could see how bad my state was when I left.</p>\n<p>My stomach refluxed again. I hurriedly chewed two tablets of antacid (Daxi / 达喜) to suppress it. Fortunately I didn’t feel like I needed to go to the toilet anymore.</p>\n<p>Finally our club people showed up and told me my friend had already gone down, and I should ride a mule down too. Coincidentally, there was only one other person riding a mule with me—the guy who gave me water up on the mountain. It turned out we were guests of the same club. His two friends also didn’t summit and had retreated early.</p>\n<p>The mule handlers were the same uncle who’d made me butter tea the day before, and his wife. They looked to be over sixty. On the one hand I felt it was really not easy; on the other hand I admired them.</p>\n<p>To go faster, they chose another route—steeper. With precipitation on the mountain, muddy water ran downhill continuously. The mules kept slipping. My mule even lunged forward several steps once, and the uncle fell once too. Sitting on the mule, all I could do was hold on tight and offer verbal concern; I felt powerless.</p>\n<p>The socks I’d changed into at Base Camp were soaked again. Both pairs of gloves still weren’t dry. My hands and feet were cold, and I felt slightly chilled overall. I’d forgotten to refill my thermos, so the water inside was only lukewarm. I endured it.</p>\n<p>At the earlier rest stop, we ran into my friend’s team coming down via another route. So our shortcut really did save time—we caught up to them. I learned she’d made it to 4,900 m; the assistant said they didn’t have enough time and had to turn around.</p>\n<p>After we finally got back to Haba Village, my first priority was dealing with my feet. They were numb with cold; I worried I might have severe frostbite. Luckily I borrowed a basin of hot water, soaked my feet, and it seemed fine.</p>\n<p>I obviously couldn’t wear my boots anymore. I borrowed a pair of slippers, then bought a new pair at the club to change into (they’re now my swimming slippers—an unexpectedly practical mountaineering souvenir). A club guy gave me a big woven sack, and I stuffed my mud-caked shoes and socks and my rain poncho into it. I had no dry socks left, so I boarded the car back to Lijiang barefoot in slippers.</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230220_21_88.jpg\" /></p>\n<p>On the drive, a sudden strong wave hit me. I tore open a vomit bag and emptied my stomach a few times, which made an aunt in front tell the driver to slow down—she said I made her dizzy. I explained that it was probably altitude sickness. But after that vomit, I felt strangely refreshed. So the earlier stomach discomfort really was an altitude symptom after all.</p>\n<p>In the following days in Kunming, besides being sore all over, the unprotected parts of my face peeled in patches—probably from cold wind. Another lesson.</p>\n<p>By rights the trip consumed a lot. Yet when I finally got back to Hong Kong and weighed myself, I was somehow 0.5 kg (one jin) heavier than before. My explanation: Yunnan food is too good.</p>\n<h3>Aftertaste</h3>\n<p>There’s an animated film called <em>The Summit of the Gods</em> (神之山岭). I’d saved it for years without watching. Three days before departure, I finally watched it, and it was deliciously on-theme.</p>\n<p>After that, on planes and trains, I read the manga. I didn’t even get through two volumes before pausing for two months after returning to Hong Kong. Then, at the end of December, I restarted from the beginning during the holidays. After re-reading the first two volumes, I recovered the motivation to continue writing this memoir, which I’d already mostly drafted in Kunming. Interestingly, I would write for a while, then read for a while. Sometimes I’d just finished describing a climbing detail or feeling, and then I’d see something corresponding in the manga. The manga also helped me recall more details to add to the text. It was a rare kind of resonance.</p>\n<p>The film came from the manga, and the manga’s original source is a novel. The author, Baku Yumemakura (梦枕獏), wrote the <em>Onmyoji</em> (阴阳师) series, which I used to love. I never expected to meet him again years later around the topic of mountains—nor did I know he was a serious outdoorsman who had been to the Himalayas many times. I also discovered Jiro Taniguchi (谷口治郎), a god-tier manga artist. The manga precisely recreates the oppression and awe that snow mountains impose, and its portrayal of human themes is incredibly mature.</p>\n<p>This story once again (I can’t even count how many times) reminded me of that classic line from <em>Attack on Titan</em>: if a person isn’t intoxicated by something, it’s as if they can’t go on living.</p>\n<p>I remember on 10.2, on the train from Lijiang to Kunming, I was deeply moved when I saw the protagonist survive a desperate situation. That night, I spent most of my time striking while the iron was hot and writing this memoir. I woke at 4 a.m. and couldn’t fall back asleep. I searched everywhere for posts and videos about Haba Snow Mountain. I accidentally ran into a Haba video on Bilibili; the uploader was exactly the travel/photography blogger I had summited Dafeng Peak with back in 2021. So I revisited his old Dafeng Peak video too. I appeared in it, and there were a few aerial shots I’d contributed.</p>\n<p>Watching those videos, I remembered so many details: how I re-injured my knee the day before the peak, and how I limped through the two days, enduring pain to reach camp and then the summit. At the end of the video, when it asked why people climb mountains, my emotions surged and I cried hard.</p>\n<p>Why? Probably because after years of being haunted by injuries, I overcame something again. It’s a strange feeling. Like I wrote in my WeChat Moments on summit day: I didn’t have a strong desire to win—I just did it. Don’t think about anything. Move until you have to turn back. Like the protagonist in <em>The Summit of the Gods</em>: as long as life continues, he will keep climbing.</p>\n<p>That blogger friend I mentioned has updated recently with climbs like Manaslu, Lobuche, and Muztagh Ata—still wearing his signature Mario “boss” hat, shooting cinematic photos among 7,000 m and even 8,000 m ridgelines. Meanwhile, I overcame old injuries, long COVID, self-doubt, and low agency, and completed this Haba summit (a simplified version).</p>\n<p>Put those two sentences side by side, and of course we start comparing. Clearly, by outcome, he surpasses me by far.</p>\n<p>But I think: if a person’s sense of worth depends entirely on the result of a single thing, life becomes unbearably painful. Even if you sometimes get what you want, the moment you obtain the result, that result stops mattering. Human eyes will always look toward the next mountain.</p>\n<p>There are three types of transcendence worth pursuing: surpass yourself, surpass the people you know, and surpass humanity’s limits. When we talk about humanity’s limits, it feels far away, and we’re less likely to cling to it. But “surpassing the people you know” is very tempting. And yet: beyond the mountain there is another mountain; beyond the person, another person. When you surpass one mountain and one person, you will inevitably meet the next mountain and the next person. Doesn’t the end of this road ultimately equal surpassing humanity’s limits? That sounds too exhausting, with little chance of a satisfying ending.</p>\n<p>Perhaps it’s better to keep things lighter: treat it as a game, and let yourself be absorbed by it. Let “comparing with others” fall back to being merely a tool to calibrate and measure the gap between you and your goals, without being trapped by the gap. One step forward or one step back is all in the heart. Everything is ordinary. As long as you act, joy and delight will naturally follow.</p>\n<p>Why climb mountains? For challenge? If so, you can climb stairs too—you can keep going, and even do 10,000 meters of continuous vertical gain. For scenery? Then beautiful landscapes that are easy to access are everywhere, and many times, like me, you may go and still see nothing. Is it because, as the Everest climber George Mallory famously said, “because it’s there”? Or, as <em>The Summit of the Gods</em> suggests, because “I am there”?</p>\n<p>I think it’s all of the above. Challenge, and scenery. Because both I and the mountain exist, a relationship can form. Like people, mountains are uncontrollable; they have their own temperament. I prefer to see climbing as a dialogue, a collision—a game between person and mountain, where the mountain is a player, not merely a setting. You can’t control the mountain, and the mountain won’t always be able to stop you.</p>\n<p>Of course, everyone has their own understanding of mountains. As long as you can still find value and meaning in it, keep climbing—until you truly have to stop.</p>\n<p>Finally, two points that aren’t novel, but I think are important:</p>\n<ol>\n<li>\n<p>Perfect timing: perhaps perfect timing doesn’t exist, because we can’t define what “perfect” is, and we can’t quantify the perfection of a moment. If perfect timing truly exists, we may have already missed it. If it’s missed, is it still perfect? Therefore, if the cost of action isn’t huge, go now. Action produces more information (<a href=\"https://commoncog.com/action-produces-information/\">Action Produces Information</a>), making optimization possible; every step makes the next step more certain. If you don’t start, you stay where you are forever. Like this Haba trip: I didn’t feel fully prepared, but I still went. Whether the summit succeeds or fails, you’ll realize you have some capability, and you’ll also see your shortcomings and improve—laying groundwork for the next round.</p>\n</li>\n<li>\n<p>Risk management: just because something hasn’t happened doesn’t mean it doesn’t exist. Don’t be a random-walk fool who keeps poking at luck. A single success doesn’t mean you’re “stable” or you’ve “ranked up.” Maybe we only happened to land on the small-probability side in an over-level challenge, while in 100 parallel worlds, the other 99 are failures. Over enough repetitions, luck averages out: if you keep probing, you’ll get closer and closer to the true odds. And some failures are the kind you can’t afford even once. In a long multi-round game, don’t think only about this round. Always leave margin: more water, more stamina, an extra battery, one more reminder. Don’t go all-in betting on mountain weather. If you’re not trying to push limits, don’t casually test the limits.</p>\n</li>\n</ol>\n<p>May you and I understand the costs, understand the returns, understand that everything is probability—and then enjoy every present moment.</p>\n<p>2026.01.20</p>\n<hr />\n<h2>Bonus: Creating with AI</h2>\n<h3>DeepSeek</h3>\n<p>This memoir about Haba Snow Mountain contains rich first-hand experiences and practical details. Below is an organized summary of the <strong>practical information</strong> and <strong>lessons learned</strong>:</p>\n<hr />\n<h4>1. Practical information and experience summary</h4>\n<h5>1) <strong>Itinerary</strong></h5>\n<ul>\n<li><strong>Tight schedule:</strong> If you compress the trip into two days and one night (Lijiang → Haba Village → Base Camp → summit push → return), you’ll have less time to acclimatize. It’s recommended to add a rest/acclimatization day if possible.</li>\n<li><strong>Transportation:</strong></li>\n<li>Direct flights from Hong Kong to Lijiang can sometimes be surprisingly cheap (e.g., Hong Kong Airlines HK412).</li>\n<li>From Haba Village to Base Camp, you can choose to ride a mule (saves energy; good for tight schedules or bad weather). Hiking is much tougher.</li>\n<li><strong>Key time points:</strong></li>\n<li>Summit pushes usually depart around 3 a.m.; you need to organize gear in advance and rest early.</li>\n<li>After descending, return to Lijiang as early as possible to avoid night driving.</li>\n</ul>\n<h5>2) <strong>Pre-trip preparation</strong></h5>\n<ul>\n<li><strong>Gear preparation:</strong></li>\n<li>Make a list early and use multiple channels (Taobao, physical stores, etc.).</li>\n<li>If there’s weather risk (e.g., a typhoon), ship gear directly to your Lijiang hotel for reception (coordinate with the hotel in advance).</li>\n<li>It’s better to over-prepare; key items (waterproof clothing, crampons, etc.) must be reliable.</li>\n<li><strong>Fitness training:</strong></li>\n<li>Short-term prep can focus on stair climbing (about 100 floors per session; ~300 m gain) to simulate high-altitude ascent.</li>\n<li>Protect your knees during training to avoid injury.</li>\n<li>Ensure adequate sleep and adjust your schedule before departure.</li>\n<li><strong>Project management:</strong></li>\n<li>Use a kanban tool (e.g., Obsidian) to track gear and itinerary.</li>\n<li>Communicate closely with teammates and clarify roles.</li>\n</ul>\n<h5>3) <strong>Gear experience</strong></h5>\n<ul>\n<li><strong>Necessary gear:</strong></li>\n<li><strong>Rain poncho:</strong> A long rain poncho (e.g., Decathlon) is important, especially in persistent rain/snow; it can serve as the outermost layer.</li>\n<li><strong>Crampons:</strong> Professional long-tooth crampons are essential on icy scree and snow slopes, but be careful about feet crossing and locking.</li>\n<li><strong>Ice axe:</strong> Useful for uphill leverage and self-arrest; never let it leave your hand.</li>\n<li><strong>Safety rope / harness:</strong> Assistants may not strictly enforce use, but it can still matter on dangerous descents.</li>\n<li><strong>Layering:</strong><ul>\n<li>Upper body: base layer → fleece → down puffer → shell → rain poncho</li>\n<li>Lower body: pants → fleece → shell pants → gaiters</li>\n<li>Hands: thin waterproof gloves + backup thick ski gloves</li>\n<li>Feet: thick socks + high-cut waterproof boots + crampons; consider cling film for extra waterproofing</li>\n</ul>\n</li>\n<li><strong>Thermos:</strong> Tie it down securely to avoid losing it.</li>\n<li><strong>Base Camp conditions:</strong></li>\n<li>Lodging is relatively basic (multi-person rooms; electricity; poor network).</li>\n<li>The ground is muddy during rainy periods; wear grippy, dirt-tolerant shoes.</li>\n<li>Food is decent; toilets are pit toilets—set expectations accordingly.</li>\n</ul>\n<h5>4) <strong>Altitude sickness and health</strong></h5>\n<ul>\n<li><strong>Prevention/relief:</strong></li>\n<li>Drink more water to support metabolism, but balance it before sleep to avoid frequent bathroom trips.</li>\n<li>Rest after reaching altitude; avoid intense exertion.</li>\n<li>Headache is common; don’t panic—adapt gradually.</li>\n<li><strong>Summit day:</strong></li>\n<li>Even if you feel awful and have no appetite, force some intake (e.g., porridge, pickles).</li>\n<li>Add/remove layers promptly to prevent hypothermia (e.g., put on down at ~4,500 m).</li>\n<li>Bring enough hot water, energy drinks, and snacks.</li>\n<li><strong>After descending:</strong></li>\n<li>Change wet socks quickly to prevent frostbite.</li>\n<li>GI symptoms (vomiting/diarrhea) may be altitude-related; consider bringing antacid meds.</li>\n</ul>\n<h5>5) <strong>Summit and descent techniques</strong></h5>\n<ul>\n<li><strong>Uphill:</strong></li>\n<li>Keep your own pace; don’t blindly chase others.</li>\n<li>On the scree slope, use crampons to step directly on rocks—place feet securely.</li>\n<li>On Despair Slope, use a steady rhythm: ice axe in → kick steps → shift weight forward.</li>\n<li><strong>Downhill:</strong></li>\n<li>On snow slopes, keep your center of gravity slightly back; look farther away instead of staring at your feet.</li>\n<li>Trekking poles greatly save energy and protect knees on non-technical terrain.</li>\n<li>If you have knee issues, slow down on descents; avoid running or jumping.</li>\n<li><strong>Safety points:</strong></li>\n<li>Follow assistants, but keep your own judgment.</li>\n<li>On dangerous sections, connect to the fixed rope.</li>\n<li>Retreating in bad weather (strong wind/snow, low visibility) is not shameful.</li>\n</ul>\n<h5>6) <strong>Other tips</strong></h5>\n<ul>\n<li><strong>Phone and comms:</strong> No mobile signal at Base Camp; Wi-Fi is unreliable—prepare to be offline.</li>\n<li><strong>Mule descent:</strong> Feet can get cold when hanging still; keep them moving if possible or use a heat pack.</li>\n<li><strong>Packing:</strong> Keep your summit pack light; leave non-essentials at Base Camp.</li>\n<li><strong>Environmental awareness:</strong> Pack out your own trash.</li>\n</ul>\n<hr />\n<h4>2. Core lessons</h4>\n<ol>\n<li><strong>Over-prepare on gear; never skimp on critical items</strong></li>\n<li><strong>Acclimatization matters</strong></li>\n<li><strong>Never underestimate weather</strong></li>\n<li><strong>Energy management matters more than raw fitness</strong></li>\n<li><strong>Assistants help, but you’re responsible for your own safety</strong></li>\n<li><strong>Psychological readiness can matter more than physical readiness</strong></li>\n<li><strong>Action beats waiting for “perfect timing”</strong></li>\n</ol>\n<hr />\n<h4>3. Who this is for</h4>\n<ul>\n<li>First-time 5,000-meter snow-mountain climbers</li>\n<li>Outdoor enthusiasts focused on practical experience and risk management</li>\n<li>Hikers who want detailed, real-world notes on high-altitude climbing and gear</li>\n</ul>\n<hr />\n<h3>Gemini-3-Pro</h3>\n<p>This is a very detailed, highly personal mountaineering memoir. The author successfully summited Haba Snow Mountain under an extremely compressed schedule (two days and one night) and harsh weather (typhoon-periphery effects; rain/snow). It contains many valuable lessons and real-world takeaways.</p>\n<p>To make the practical information easier to absorb, I organized it into a “Haba Snow Mountain Speed-Ascent Field Debrief Dashboard.” The HTML page includes itinerary analysis, gear red/black lists, fitness prep, and key lessons.</p>\n<h4>Visualization notes</h4>\n<ol>\n<li><strong>Itinerary and altitude overview:</strong> A clear picture of the “special forces” style 2D1N schedule, emphasizing the risks of rapid altitude gain.</li>\n<li><strong>Gear field review:</strong> Categorizes items into “dark horse (unexpectedly great),” “core (must-have),” and “lessons (needs improvement).”</li>\n<li><strong>Key route segments:</strong> Breaks down the difficulties of the “scree slope” and “Despair Slope.”</li>\n<li><strong>Experience and lessons:</strong> Extracts practical suggestions on altitude sickness, logistics, and body care.</li>\n</ol>\n<p>You can save the code as an <code>.html</code> file and open it in a browser, or just view the rendered layout idea.</p>\n<p><em>(To fit platform display, the HTML was manually converted to an image.)</em></p>\n<p><img alt=\"Haba Snow Mountain Speed-Ascent Field Debrief Dashboard\" src=\"assets/images/gemini-summary.png\" /></p>",
    "date": "2026-01-20"
  },
  {
    "title": "我的哈巴雪山之旅",
    "file": "my-haba-snow-mountain-journey.html",
    "markdown": "my-haba-snow-mountain-journey.md",
    "html_content": "<h1>我的哈巴雪山之旅</h1>\n<p><em>（本文正文字数约11,600字，完全出自人类，如果觉得太长，可以直接前往文末的AI Bonus部分）</em></p>\n<p>此刻已在昆明，刚刚把登顶回来的全部装备清洗完毕。趁记忆还没被洗掉太多，我想赶紧把它们都倒出来。</p>\n<p>2025.10.02</p>\n<h3>时间表</h3>\n<ul>\n<li>09.20 和朋友确定行程并买机票</li>\n<li>09.29 22:00直飞抵达丽江</li>\n<li>09.30 6:00上车前往哈巴村，接着骑骡子到大本营</li>\n<li>10.01 3:00出发，9:30登顶，14:30回到大本营，骑骡子返回哈巴村，坐车返回丽江</li>\n</ul>\n<h3>行前准备</h3>\n<p>行前准备主要有3块，行程、物资、体能，都值得一说。</p>\n<p><strong>行程方面</strong>，由于每日登山名额的关系，临时压缩到两天一夜，因此变得非常紧凑，我们少了一晚在哈巴村休整、适应海拔的时间。也是因此我们提前决定骑骡子，而不是徒步从哈巴村往返大本营。机票方面，香港直飞丽江的票价出乎意料地便宜，香港航空HK412，总价753港币。 </p>\n<p><strong>物资方面</strong>，有许多东西都需要准备，朋友是第一次爬雪山，也要稍兼顾。物资来自不同渠道，有一些以前的装备需要从老家邮寄，有一些装备和大部分消耗品需要淘宝，有一些通过香港的网店购买，还有一些关键装备需要去实体店挑选。物资清单随时间改变，因为我一直在刷小红书上的帖子，不断修正理解。</p>\n<p>物流也遇到了问题：正在加购物车的那几天，关于台风桦加沙的预报越来越清晰（实际达到了最高等级的十号风球），我判断内地的物资转运香港存在较大风险。解决方法是先订了丽江的酒店，然后所有在内地的物资都寄向酒店。最终总共有10个快递由酒店陆续接收，8个完好，1个快递破损进水但内部问题不大，1个丢失。全过程像是给酒店做了一次压力测试，为此非常感谢酒店小姐姐和快递小哥，电话微信来回沟通，还不收我的红包。这种办法带来的坏处是大大增加了抵达酒店后的工作量。</p>\n<p>事后回顾，虽然花了很多精力，物资准备还是有不周之处，有多余的，有缺少的，好在最关键的部分没有问题，大体上承受住了考验。</p>\n<p><strong>体能方面</strong>，考虑到行前必须留出一两天恢复期，一共就只有七天时间可以做一些准备，中间还穿插行程和物资方面的事情。参考小红书攻略，同时考虑台风及便利性的问题，我最终的体能准备计划很简单：</p>\n<ol>\n<li>确保睡眠：尽量在12点前睡觉；</li>\n<li>确保膝盖旧伤不复发：每日补充氨糖、维D；</li>\n<li>确保爬升耐力：爬楼梯</li>\n</ol>\n<p>执行情况：</p>\n<p>睡眠方面基本上每天都在12点左右，只有一天2点过才睡；</p>\n<p>爬楼训练总共进行了5次，具体做法：从楼下爬到楼顶，再坐电梯下来继续爬，无下降训练，最主要是担心膝盖无法恢复甚至提前掉链子（之前四姑娘山大峰的宝贵教训）。除开坐电梯下来的时间，每次训练时长大概是30分钟，完成后补充辅酶Q10，兼用热、电、力的方法加速全身恢复。每次训练的楼层数在100左右，大概300米爬升，达到小红书上一些帖子中的基准线，帮助建立了比较初步的信心。</p>\n<p>我是第一次做爬楼训练，最难受的点是上下楼的切换：当你爬上十几层楼全身爆汗，从楼梯间进入过道和电梯，香港标配、不要电费般的冷气能无死角吹得你汗毛倒竖，所以还得一直拿着一件连帽外套，一会穿一会脱。优点是坐电梯下楼顺便提供了合理的休息间隔。至于楼梯间不通畅的空气，虽然加剧痛苦，但一定程度模拟了高原环境。</p>\n<p>从项目管理的角度回顾，三部分准备互相交叉依赖，算得上是一个不小的项目，好在人员方面比较简单，只有一个朋友同行。靠微信沟通，加上用obsidian搭了个看板（最主要是跟踪物资），就把整个复杂度吃下来了。</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230544_23_88.jpg\" /></p>\n<h3>Day 0 香港-丽江 0-2400</h3>\n<p>晚上22点过到丽江机场，23:15到酒店后，一直在找快递、拆快递、整理物资（根据最新情况重新分配和压缩带去哈巴村的物资，多余物资寄存在了酒店），直到1点过上床。第二天又要早起赶去哈巴村，当晚只睡了4.5h。</p>\n<h3>Day 1 丽江-哈巴村-大本营 2400-4100</h3>\n<p>6:00出发，车上吃了朋友提前订的早餐，本想着能在车上补个觉，但因为想看外面风景，一路清醒过去。路上一直阴天，车子沿途经过虎跳峡，云雾之中也很美，虽未停留，也算是做了个快速预览，有天还会专门来的。</p>\n<p><img alt=\"回望虎跳峡\" src=\"assets/images/Image_20260120230131_1_88.jpg\" /></p>\n<p>8:30左右进了村，这时阴雨纷纷，我状态不太好有点头晕，心想ok，与高反的斗争又一次打响。到俱乐部后，喝了阿叔现熬的酥油茶，烤了一会火，感觉好多了。又一次重整行李，用保温杯装上了满满一杯酥油茶，穿上了三件套和雨衣，剩下大部分背在身上，小部分放进编织袋（现在回想为什么不是大部分放编织袋，也许是因为编织袋挂在骡子身侧，会有不平衡的问题）。紧接着就上了骡子，哈巴雪山之旅正式开始。</p>\n<p><img alt=\"酥油茶\" src=\"assets/images/Image_20260120230133_2_88.jpg\" /></p>\n<p>骡子走的马道与徒步有所不同，但一路上的景色也是挺美的。凉但不大的雨一直下，我们穿行在薄雾的林间，泥泞中一路颠簸向上。大部分时候，除了我们再看不到人迹，偶见牛羊。到中途休息站的时候，才与徒步的人们有短暂照面。可以想见这种雨雾泥泞之中，徒步的辛苦。这一段，总共上升了1200米。</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230140_3_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230144_4_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230154_5_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230156_6_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230158_7_88.jpg\" /></p>\n<p>一路颠簸到麻木，当大本营的棱角终于从雾中浮现时，内心很是喜悦。赶紧下了骡子朝里走，发现大本营的规模比想象中大不少，挺热闹的，居然还有小卖部。</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230203_10_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230205_11_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230207_12_88.jpg\" /></p>\n<p>接下来整个下午和前半夜都是在大本营度过的，写几个观察：</p>\n<ol>\n<li>\n<p>大本营的住宿条件是很不错的，我住的那间比较挤，四架高低床以外的空间只有三、四平米的样子，八个男的挤一间，感觉回到了学生时期的宿舍。房间内没留下前人的垃圾，床上用品都有用一次性薄膜包裹住，味道也不大，算是做到了基本的卫生。房间内有插线板，不过电源线要自备。营区号称是有WiFi的，也有人说连得上，但我的苹果和OPPO两个手机没有一个成功连上的，山上又没有移动信号，朋友又在女生宿舍，所以我一直处于与外界失联的状态。\n  <img alt=\"\" src=\"assets/images/Image_20260120230200_8_88.jpg\" /></p>\n</li>\n<li>\n<p>若说要差评的，除了网络就是营区的地面了。营区的地面等于没有地面：想象一大片胶状、厚十几公分、带有腥臭味的泥泞，里面散布着一些不知道是人为还是天然的石头，便是了。在营中穿行的时候，你得确保每一步都精准踩到一块石头上，否则便会获得踩屎感+1。我在营区的半天里是至少+7、+8的，鞋子越发惨不忍睹。或许非雨天的体验会好不少，可惜我们去时已经连续几天降水了。</p>\n</li>\n<li>\n<p>关于吃喝拉撒。饮食体验是真的可以给好评的。大本营内有多个独立的饭堂，你去哪家取决于你的俱乐部安排。我去的那家算是不错的，晚饭和早饭都是自助，有肉有菜有饭有汤，挺丰富的，油水也够，味道还不错。厕所方面，差不多就是经典旱厕的情况了，即使是对于所谓营内最干净的厕所，也不要有任何不合理预期。\n  <img alt=\"\" src=\"assets/images/Image_20260120230202_9_88.jpg\" /></p>\n</li>\n<li>\n<p>关于体检和讲解。所有登山者下午到达后都要做简单的血压和血氧检查，但是血压是隔着外套量的，血氧是夹手指，我测的时候瞥到我的数值是74（？），怀疑看到的是心率。虽然挺水，但至少是对着名单逐一做了。当所有人都到齐、体检完，讲解就开始了。这部分是有干货的，指导们主要讲解了安全问题，以及如何使用之后配发的装备：头盔、冰镐、安全带+安全绳、冰爪。特别强调的有几点：头盔和冰镐不能离身，绝望坡危险路段必须结合新修缮过的路绳使用安全系统，不要随便吃任何药物（包括葡萄糖），因为协作（其实还有你自己）会无法准确评估你的身体状态，更严重则可能导致高反症状加重。</p>\n</li>\n</ol>\n<p>关于这几件强制要求的装备，有很多可说。</p>\n<ul>\n<li>\n<p>头盔：你的头灯需要卡在上面。头盔的密闭性不好，所以不太能防风防水，因此最好不要作为最外层。我当天的情形：最里层是毛线雪帽、然后头盔、再然后是雨衣的兜帽。我的冲锋衣穿在雨衣内，虽然带帽子但不是兼容头盔的设计，所以只能用雨衣兜帽作为最外层，紧紧的并不太舒适。</p>\n</li>\n<li>\n<p>冰镐：很有用的一件装备。上坡时可以用作行走镐借力，休息停顿时用于身体支撑，雪线以上若是滑坠能用来制动救命。但说到滑坠制动，下午的讲解没有说得很细致，讲的时候冰镐都没发下来，更没有实际练习，亲测摔的时候基本反应不过来。虽是如此，强烈建议不要离手，特别在雪线以上，离手风险很大（参考前不久发生的那玛峰悲剧）。</p>\n</li>\n<li>\n<p>冰爪：跟冰镐的重要程度不相上下。没有冰爪的话，在碎石坡冰雪路段、绝望坡积雪路段，绝对是寸步难行。我几年前爬四姑娘山大峰的时候，用的是自己买的简易冰爪，齿很短。这是第一次用比较专业的款式，齿很长，真的跟爪子一样。这件装备的缺点不少：重量大、穿戴非常麻烦（虽然主要是麻烦了协作）、有安全风险（两脚交叠会互相卡死导致摔跤，再次参考那玛峰悲剧）。但相比之下，它带来的好处更大，我后边还会提到。</p>\n</li>\n<li>\n<p>安全带+安全绳：一套难穿戴的装备。官方指导是要求绝望坡路段必须使用的，但我实际看到的情况是，基本没有一个协作会让你用。甚至坡上的一半路段你都是远离路绳的。我个人推测的原因：上升器每一小段都需要开锁闭锁，而登山者大部分是小白，大概率只能让协作帮忙，太费劲耗时；另外在雪线之上，雪下藏着一些窟窿陷阱，相比路绳所在，协作们会优先选择前面有人趟过、踩实一些的路线，或者这些路线本就是他们都经常走、比较清楚的。就我而言，这一套安全装备，只在峰顶下降的最陡峭段派上了用场：协作牵住绳子预防我水灵灵地滑走，我手也能主动借一些力。</p>\n</li>\n</ul>\n<p>上面这几件强制装备，加起来应该得有十斤，如果冲顶时选择自己背包，那负重都是你的，如果让协作背，只可以少一个冰爪的重量。</p>\n<p>既然说到了装备，顺便列一下冲顶时我携带的所有衣物装备：</p>\n<p>上身：速干衣、抓绒、排骨羽绒、冲锋衣、长摆雨衣\n下身：速干裤、抓绒、冲锋裤、雪套\n手：两双防水户外薄手套、一双滑雪厚手套\n脚：两双户外袜、两双长羊毛袜、高帮防水登山鞋、冰爪\n头：毛线帽、抓绒面罩、墨镜、头灯、头盔</p>\n<p>这里边有两点值得一说：</p>\n<ul>\n<li>\n<p>长摆雨衣：并不是一次性的便宜货，迪卡侬两百多一件。雨衣称得上是这次装备里的黑马。在前期准备时，我一直把它放在比较低的优先级。首先冲锋衣裤本身具有不错的防水能力，雨衣的重要性就下降了；其次是它的压缩体积算是比较大的，很占空间。几年前去雨崩和四姑娘山大峰，徒步时都是晴天，所以也没深刻教训。去哈巴村之前，我都差点把它寄存在丽江了。但实际情况呢？两天一夜全程几乎都在下雨或下雪，冲锋衣裤的防水性能压力很大，雨衣起了相当大的作用，全程作为最外层发挥着作用。</p>\n</li>\n<li>\n<p>袜子+登山鞋+雪套+冰爪：这几件下半身装备放在一起再说一下。首先，冰爪的穿脱是很麻烦的事情，所以穿上后你几乎不会想要考虑中途脱掉，那么什么情况你会考虑这个事情呢？那就是换袜子。前三者一套组合的防雪防水能力，大不过一路上雨雪侵袭的能力，那么袜子一定会湿透、鞋子一定会浸水。变重倒是次要，更大问题是失温和冻伤。在冲顶包括返回大本营的路程中，人一直在走动，脚部的热量很充足。回到大本营后，你可以换袜子，但鞋子一旦湿透，就不是那么容易干的。接着再向下回村子时，如果你选择骑骡子（大部分人的选择），脚一直悬着不动两三个小时，低温下湿透的鞋子绝对是持续魔法伤害。对于此，我后来补课学到的简易升级是：套保鲜膜，牺牲透气性，换来防水性。</p>\n</li>\n</ul>\n<p>回到当天下午的大本营，吃完饭、领完装备以后时间已经六点多，天这时也黑透了。整理好冲顶装备后，唯一要务便是休息。但这不是一个简单的任务，有两个困难：时间、高反。冲顶的标准出发时间是凌晨三点，所以差不多两点过就得起来。因此最好的情况是原地睡着一直到两点，但这跟我们平时的生物钟相差太大了。而高反虽程度因人而异，但在4000米以上很少有人毫无感觉，这绝对加大睡眠的难度。关于高反的预防/缓解，公认的一点是多喝水，水分能加快身体代谢适应，但多喝水必然多排泄。离我们宿舍最近的厕所在几十米外，黑漆麻黑的烂泥地走一趟也是很痛苦的。因此睡前喝多少水也是一个纠结的问题。</p>\n<p>高原上的夜或许就没有不难熬的。我个人的记忆如下：7点半躺好闭眼，没多久进入迷糊状态，醒来以为睡了很久了，结果看表才9点半。接下来便再也睡不着了，之前若有若无的头痛变得很明显，手表测出来的血氧与心率都挺难看。为了保暖，宿舍门是关上的，一群男人+不大的空间，氧气只少不多。接下来的几个小时中，头痛到睡不着的我陷入了经典循环：不断尝试睡着，不断看表（时间、心率、血氧），不断观察其他人的情况——倒还真有人睡得打呼噜。也有人同样辗转反侧，甚至有人打开门吸氧，然后又因为冷风关上，轮流上台下台。就这样，一点一点，磨掉那几个小时。</p>\n<h3>Day 2 哈巴雪山 4100-5396-4100</h3>\n<p>大概一点过的时候，外面突然响起来了，细听应该是下起了很大的雨。我心想，得，这是把难度继续往上拉。好在雨下到两点左右就小了。几乎所有人都比预定的时间要早起，因为实在是睡不好。差不多等所有人都有了动静，有人把灯打开的时候，我有种像是松了口气的感觉，至少不用再徒劳地努力了。有人说：“看到大家状态都这么差，我就放心了。”一个从村子徒步上来的东北大哥直接决定放弃冲顶。</p>\n<p>我此时的状态也是极差，头又痛又涨非常难受，心里打着大大的退堂鼓。坚持着去了食堂，但什么都吃不下，勉强就咸菜喝了半碗米粥，拿保温杯接满热水就回了宿舍。坐在床上又一件一件点着要带的东西，等我的协作。</p>\n<p>等待的过程中，我决定好什么都不要去想，先走走看。</p>\n<p>既如此，那就尽可能增加登顶的概率。于是我在提起装好的背包，感受到二十多斤重量后，几乎没有犹豫就请求协作小哥帮忙背包（小小钞能力）。</p>\n<p>出门的瞬间我按下了手表，开始记录徒步。事后回顾，那一刻是2:59。</p>\n<p>朝上望去，黑暗中已有很多摇曳的光点，许多人已经提前出发了。类似的一幕在四姑娘山大峰我已见过一次，只不过那时我们在大本营200米以上的地方扎营，所以出发时看到的光点是在下面。这一次我没有第一次时的兴奋心情，经验就是这样的一把双刃剑吧。</p>\n<p>雨量依然维持在小雨，而且我披着雨衣，所以不算劝退，接下来就只剩向上干。边走我边把小罐红牛慢慢喝掉，咖啡因至少能让连续两夜没睡好的我清醒一些。中途协作小哥不怎么说话，总是在稍前或稍后的地方等我，这也挺好，我就默默地向前。中途两三次我提起现在几点了，他才回说这个点才到这blabla。我也没细算，估计离关门时间还有一定量的时间，那就继续干。目标很清楚，就是在不得不停下来的时候，才停下来。</p>\n<p>黑夜、交织的头灯、细雨、冷风、汗水、喘气声，继续向上吧。不知道是哪个点上，我意识到我的头没有先前那么疼了，继续向上吧。不知不觉间，前方变得更黑了，后面的灯光则多了许多，继续向上吧。</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230208_13_88.jpg\" /></p>\n<p>如人所说，哈巴的冲顶是真的一直往上，沿途几乎没有平路（4KM爬升1300）。体能外的挑战是冷雨和越往上越大的风。到达4500的避风小屋外时，我身上已经开始打颤，失温的威胁清晰了。即使是在有雨衣、冲锋衣的情况下，我的抓绒也已经半湿了，也不知是从外到内的贡献多，还是从内到外。屋里挤满了换衣服的人，在协作小哥的建议下，我先把冲锋、抓绒脱掉，拿出包里的排骨羽绒，穿在里面包住热量，抓绒穿在羽绒外，最后穿回冲锋。这好像与一般的顺序相反，但是效果很好，冷的感觉不久就止住了。若非如此，只怕我在此便要下撤了。后来得知，当天确实很多人是在这附近下撤了。换好了衣服，我们走到屋外找相对避风的地方进行补给。就是这时，我发现了我原本插在登山包上的保温杯不见了，好在小哥让我喝了他自己的热水。</p>\n<p>继续向上。天开始蒙蒙亮。继续向上。大石板地形变成了遍地乱石。</p>\n<p>小哥找了一个遮蔽处，脱下背包让我把冰爪拿出来，要我充分补给然后把背包留下。直到这时我才意识到，啊，原来我们已经来到这个阶段了。扑在脸颊上的冰冷变得更具实感，是雨夹雪。</p>\n<p>这是整个登顶路线的转折点，应该叫碎石坡，技术路段由此开始。相对前面枯燥的向上，这一段走起来是非常有趣的，我把它形容成是一种冰爪、冰镐、手脚全方位运用的跳跳乐。冰爪着实让人又爱又恨，很快我就亲身领会了什么叫冰爪交叠会摔跤（再次cue那玛峰悲剧）。长雨衣下摆也有被踩到的风险。在这些麻烦之外，冰爪带给我的感觉，就是强大。那些错综复杂的大石块，你居然可以直接在上面行走。石上的积雪/薄冰清晰记录了小哥以及更前面人（已见不到人影）的齿印，所以你会非常明确地意识到有人走过那里，但又觉得不太相信：啥，那个角度你可以直接踏上去吗？但身体比大脑先被说服。</p>\n<p>大概是因为有趣，这一段感觉挺快就过去了。跳着跳着，前方突然没有石头了，变成了一片茫茫的白，绝望坡开始了。这时我感觉自己的体力已经到了一个瓶颈区。还是那样，什么都不想，能走几步就走几步吧，一直走到不得不回头。</p>\n<p>绝望坡为何名为绝望？</p>\n<ul>\n<li>坡度：45度左右，对身体重心控制有一定要求</li>\n<li>地形：雪坡，10月份体感大概有20-30厘米厚的雪，厚度并不均匀，最表面的雪更松，不容易踩稳。雪掩盖了下面的地形，隐藏着的窟窿缝隙是很危险的。有部分路段因为前面的人都走，雪会踩实一些，也排了一遍暗雷，但是路面也会变得更滑。</li>\n<li>爬升：4900-5300，共400米爬升，结合海拔、坡度、地形的影响，这真不是普普通通的400米</li>\n</ul>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230212_16_88.jpg\" /></p>\n<p>雪在脸上胡乱地拍，我没有戴雪镜，而是眼镜外夹的墨镜片。镜片一直处于模糊的状态，堪堪能看到脚下的路。向左右望去，都是一片浓稠的灰白，能见度大概几十米。向上的每一步都要用力踢进雪中，靠冰爪稳住支点，再将冰镐插进前方的雪里，将重心倚靠上去，再进行下一步。双手一插，左脚、右脚、停，再叩首，循环往复的拜年剑法。途中因为滑倒，雪没踩实，或者冰爪死锁摔了好几次，在地上的雪和空中的雪交叉袭击下，虽然有雨衣等装备，我的手套（已经换完了最后一双）和鞋子都湿透了，手和脚都能明显感受到布料的吸水膨胀。</p>\n<p>体力持续消耗，到后面变成了七八步、五六步就得停一停，用拜年的姿势喘息片刻。缺水是另一大问题，我和小哥的水都放在了碎石坡没带，渴到嘴里有一种很苦涩的味道。到后来我认真考虑过塞一口没被人踩过的雪，但不知道我的食道和肠胃是否扛得住。幸运的是接近登顶的时候，人又多了起来，我看到一个小哥背包侧有瓶可乐，询问下他说包里还有一瓶矿泉水，拿给我灌了几口。冰凉的生命之源！小哥说那瓶水就直接给我了，我拒绝了，跟他说在这种地方水太宝贵了，怎样都还是自己留着好。</p>\n<p>另一值得感谢的是，I人感的协作小哥没有像网上一些帖子那样，拉扯我一步步向上，只是示范和领路，让我自己体会和努力，虽然过程中越发毒舌（“你集中注意力好好走啊”，“你这个冰爪怎么搞成这样的，搞不定了，没办法，就这样吧”，“你别跟我说话了，快点往上走，赶快登顶了你才算厉害”，“哪会有那么渴，我们都走了很多遍了，都清楚得很”...），但始终没有劝过我下撤。</p>\n<p>终于，听见前面的人说看到牌子，看到有人在拍照了。我抬眼望去，看到的只是视野左上的一小块模糊不清的阴影。他们说只差几步了，可我就是挪不动步。但终于，还是一步步挪了上去。</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230209_14_88.jpg\" /></p>\n<p>绝顶上依旧一片朦胧，而且风雪更大。拍照的过程快到不可思议，花了几分钟喘着气排队，然后放下冰镐、脱下头盔、戴上纪念牌，掏出手机给小哥，刷刷两张搞定，揣回口袋，我甚至没有心思对着碑以外的地方随便摁几下快门（当然朦胧中也没什么可拍）。照片的时间是09:31，从三点到九点半，齐整的6个半小时。</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230213_17_88.jpg\" /></p>\n<p>登顶只能算完成一半，面前摆着“返回”的难题。风雪的冰冷、严重耗损的体力、随时可能发作的膝盖旧伤，种种威胁扼杀了一切慢慢玩味的情绪。</p>\n<p>上山容易下山难是永恒真理。在绝望坡不断向下，一路上连滚带爬。冰镐能帮上的忙少了，腿也开始软了，一滑一个准，向后大屁股墩、向前双脚失控前冲数米什么的，都经历过了。所谓的后脚跟踩实就像是玄学：另一只脚不往下迈的时候，永远不确定这一只脚是否真的踩实。我将之形容为雪会跟你的脚讨价还价。如果答案是否，那就必然滑倒，一路上搞得协作小哥不断吐槽，结果他自己最终也不免滑一两跤。过最危险的部分时，他拉着我的安全绳，我自己也拽着绳子，就这样稀里糊涂、半人半狗地往下。逐渐掌握到一点下山诀窍，那就是不要死盯着脚下，生怕没踩稳，不如往远处望，让身体自己感觉和控制（这样或许重心也会后一点）。</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230210_15_88.jpg\" /></p>\n<p>分明已经过了很久，往远处望，还是望不到尽头的长坡。到最后一段时，似乎是因为天上掉下来的一些许阳光，加上体力耗尽，感觉整个人都很困，连小哥也开始打哈欠。只能抓紧向下，不然会更危险。</p>\n<p>终于回到了乱石交错的碎石坡，这时体力已经到了一个极限，加之这回是向下，上来时很快就过去的地方，现在却感觉怎么这么困难...终于回到了放装备的地方，大喝几口已开始结出冰渣的水，脱下冰爪。听小哥的建议，脱下全湿的手套，把手缩进雨衣袖子来取暖（有所怀疑但事实证明效果不错），继续往下。</p>\n<p>不再有雪的路段，将冰镐交给小哥帮忙拿着，我掏出了S级道具：登山杖。第一次感觉到登山杖=快乐！拿着杖向下，莫名其妙地逐渐涌出很多力气，或许是因为平日徒步的熟悉感有所回归。虽然小哥也越走越快，我却能紧紧跟住，也终于有心思掏出手机拍几张照片。途中遇见另一个协作，看我走得心花怒放，有意无意带难走的路让我挑战，最终演变成一个大坡要我飞奔下去...结果就是膝盖终于开始疼了起来，但是到这里才开始疼，已经是300%地给力了。胃里开始一阵阵反酸，并且有拉肚子的前兆，我喝水硬生生压了下去。肉眼已经可见的大本营，却还是走了好久都走不到。</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230218_20_88.jpg\" /></p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230215_18_88.jpg\" /></p>\n<p>小哥后段里越冲越快，逐渐拉开我几十米，但终于放慢脚步，愿意聊几句天。原来他不是哈巴本地人，而是云南其他地方的，以前经常徒步，后来当工作赚钱。他解释说之前一直想用激将法激我，不是真心觉得我有那么差，还说觉得我挺有毅力的，今天天气不好，但还是上去了。</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230216_19_88.jpg\" /></p>\n<p>继续走啊走，终于还是走到了大本营。此时是下午2:30，又是挺齐整一数，总计11.5个小时的哈巴徒步结束了。</p>\n<h3>归途 4100-2400-1900-0</h3>\n<p>此时的大本营很冷清，大部分人都已经离开了。根据协作们当天的估计和我后来在小红书上收集到的信息来看，当天的登顶率大概是15%-20%，也就是300人里大约45-60人成功登顶。提前下撤到大本营的人也就先继续向下了。</p>\n<p>手机没有信号，也联系不上朋友，自前一晚饭后就没见过，不知道她情况如何。还完装备，我四处找人询问无果，听人建议先去小卖部烤一会火。这时里面已经坐满了登顶下来的人，好不容易蹭了个角落烤了小会儿手套，就回宿舍换了双袜子，开始收拾东西。</p>\n<p>宿舍的地板一片狼藉，全是脚印和垃圾。这时才发现我的保温杯就安然躺在我的床上，所以是出发的时候因为我没有拴紧而从包上滑落的，又是一个大大的教训。这时对床的小哥进来了，聊了两句才知原来他没登顶。我有些讶异，因为前晚聊天时知道他比我经验丰富一些，而且体格也很结实。我觉得他大概率是因为前一天徒步耗费太多体力了，雨中的两日哈巴，强度大上很多。他也对我成功登顶显得有些惊讶，毕竟我出发时的状态之差一看便知。这时胃里又是一阵泛酸，赶紧嚼了两片达喜压住。好在这时没感觉要拉肚子了。</p>\n<p>终于等到我们俱乐部的人，跟我说朋友已经先下去了，让我也骑骡子下去。说来也巧，同行骑骡子的就另外一人，正是在山上给我水的小哥，原来我俩是一个俱乐部的客人，他的两个朋友也没登顶提前下撤了。牵骡子的人则是前一天煮酥油茶给我喝的阿叔和他的妻子，他俩年纪估计得六十往上。我一方面觉得真不容易，一方面也很是佩服。下山的路他们为了更快一点，选了另一条更陡峭的路上。山上降水，泥水一直向下流，骡马都不停打滑，我的骡子有一下甚至前冲好几步，阿叔也摔倒一次。我坐在上面除了牢牢把住、口头关心一下，也觉得很无能为力。在大本营换的袜子又湿透了，两双手套都没烤干，所以手脚都很冷，整个人也有点小冷，保温杯的水忘了换只能说是温热。就这样坚持着。</p>\n<p>到了之前休息站的时候，遇上朋友的队伍从另一条路下来，原来我们这个近道还真是省了不少时间，居然追上了。聊聊才知她一直走到了4900，协作说时间不够了才开始下撤。</p>\n<p>好不容易回到哈巴村，第一要务便是处理我的脚，这时已经冻到麻木，我很担心会严重冻伤。好在借到人家的热水一盆，泡完感觉没啥问题。鞋子肯定是穿不得了，于是借了双拖鞋，到了俱乐部买了双新的换上（现在变成了我的游泳拖鞋，也算是很实用的登山纪念品了）。俱乐部小哥给我拿了个大编织袋，把我全是泥污的鞋袜、雨衣丢进去。也没干的袜子了，我就这样光着脚穿着拖鞋上了返回丽江的车。</p>\n<p><img alt=\"\" src=\"assets/images/Image_20260120230220_21_88.jpg\" /></p>\n<p>途中突然一阵强烈的感觉，赶紧扯开呕吐袋哇啦几下，搞得前边阿姨让司机慢点开，都给我搞晕车了。我解释了下应该是高反造成的。不过吐了这么一下，整个人就清爽了。原来之前肠胃不适，最终还是高反的体现啊。</p>\n<p>此后在昆明的几天里，除了浑身酸痛，脸上没防护好的地方一块块地脱皮，应该都是冷风吹的，又是一课。按理这一趟下来消耗很大，结果等最后回到香港一称体重，居然还比出发时重了一斤，我对此的解释是：云南美食多。</p>\n<h3>余韵</h3>\n<p>一部叫《神之山岭》的动画电影，我收藏多年未看，启程三天前终于看了，应景时果然更有滋味。之后飞机和火车上都在看漫画，进度不到两本，回到香港后中断了两个月。直到12月末，趁假期从头开始看。重刷完前两本后，我找回了动力续写在昆明已完成大半的这篇回忆。有趣的是，我写一会看一会，有时刚写完一些爬山细节和体会，就在漫画里看到了对应的内容。漫画也帮助我回忆起一些细节，补充进了文里。属实是一种难得的共振体验。</p>\n<p>电影脱胎于漫画，而漫画的原著是小说，作者梦枕獏的《阴阳师》系列是我曾经很爱的作品，没想到多年后会在山这个话题上再相遇，没想到他是资深的户外爱好者，去过好多次喜马拉雅。另外也新认识了谷口治郎这位神级漫画家，漫画精确再现了雪山带给人的压迫和震撼，人文部分的描绘也极其纯熟老道。这个故事让我又一次（已经不知道多少次）想起《进击的巨人》里那句经典的台词：人如果不沉醉于什么，就仿佛活不下去。</p>\n<p>记得10.2在丽江往昆明的火车上，我看到主人公绝境生还那一幕的时候，很是感动。那天晚上，我大部分时间都在趁热打铁写这篇回忆。凌晨四点醒了，便再睡不着，到处找哈巴雪山的帖子和视频来看，无意间刷出B站一个哈巴视频，up主正是21年时在四姑娘山大峰一起登顶的旅行/摄影博主，于是又回顾了他那时候做的四姑娘山大峰视频。视频里面有我出镜，也有我贡献的一点航拍镜头。看着视频，回忆起好多细节，比如我是怎么在大峰前一日把膝盖旧伤搞复发，那两天又是怎么一瘸一拐地忍着痛走到营地，再上到山顶的。看到视频末尾，追问人为什么要爬山那一段时，情绪异常汹涌，大哭了一场。</p>\n<p>为什么呢？大概是为在数年的伤病困扰之后，我又一次有所战胜。这其实是很奇妙的感受，就像我登顶当天发朋友圈说的，我没有强烈的胜负欲，but just did it，就是做到了。什么都不去想，动吧，直到不得不回头。就像《神之山岭》的主人公，只要生命不息，就会继续登山。</p>\n<p>前面提到的这位博主朋友，最近的几次更新分别是：马纳斯鲁、罗布切、慕士塔格，还是戴着他那个标志性的马里奥boss帽子，在7000甚至8000+的山岭之中，拍出来各种大片。而我则战胜旧伤、长新冠、自我怀疑和能动性不足，完成了这次哈巴登顶（简化版）。</p>\n<p>这两句话放一起，我们自然是会开始比较的，很显然从结果上看，他超过我太多。</p>\n<p>但是我想，如果人的价值感完全取决于一件事的结果，那么人会活得痛苦万分。就算偶尔如愿，在拿到结果的那一刻起，这个结果便不再重要。人的眼睛，会始终望向下一座山峰。</p>\n<p>有三种可追求的超越：超越自己，超越认识的人，超越人类的极限。讲到人类极限，我们会觉得距离太远，也就不容易为其而执，但“超越认识的人”是很有诱惑力的。只是山外有山，人外有人，当你超越一座山、一个人，必然会认识到下一座山、下一个人，这条路的尽头难道不就等同于超越人类的极限？这好像有点太辛苦了，难有一个圆满结局。或许倒不如轻松一点，只为游戏、为沉醉，让“和人比较”退为单纯用于校准、衡量与目标之间差距的工具，但不必为差距所困。进一寸、退一寸都只在我心，一切皆是平常，只要行动，欣喜和愉悦便自然跟随。</p>\n<p>为什么要爬山？是因为挑战吗，那么如果你想的话，爬楼梯也可以一直爬下去，连续爬升10000米都可以。是因为景色吗，那么轻松直达的美景比比皆是，也有很多时候像我一样就算去了也看不到什么。是如马洛里所言的“山就在那里”吗？还是《神之山岭》中所言，是因为“我就在那里”？</p>\n<p>我想，都是的。因为挑战，也因为美景。因为我与山均在，所以人可以与山建立某种关系。和人一样，山是不可控的，它有自己的脾气。我更愿意把爬山看成是一种对话，是碰撞，是人与山在玩一个游戏，游戏里山是玩家，而不是设定。你没办法控制山，山也不会总是阻挡得住你。</p>\n<p>当然每个人都有自己对于山的理解。只要你还能从中找到价值和意义，那就继续爬山吧，直到不得不停下来为止。</p>\n<p>最后，两点不新颖但我觉得很重要的：</p>\n<ol>\n<li>\n<p>完美时机：或许可以认为完美时机不存在，因为我们根本无法定义什么是完美，无法量化一个时机的完美程度。假如真的存在完美时机，说不定它也已经被我们错过了。被错过的完美时机，还是完美的吗？因此，如果行动需要付出的代价并不大，那现在就去做吧。行动能产生更多信息（<a href=\"https://commoncog.com/action-produces-information/\">Action Produces Information</a>），让优化成为可能，每一步都会让下一步更有把握。不开始行动，就永远停留在原地。就如这次哈巴，我感觉没有准备好，但还是去了。登顶成功或是失败，都能意识到自己有一定的能力，也意识到自己的不足，可以做出改进，这都为下一局做了铺垫。</p>\n</li>\n<li>\n<p>风险管理：没有发生的事情，不代表不存在，不要做随机漫步的傻瓜，去不断试探运气。单次的成功不代表你稳了、晋级了，或许我们只是在越级挑战中碰巧落在小概率的那一边，而在100个世界里，其他99个都是失败。遍历性（Ergodicity）决定了，如果我们不停试探，便会越来越接近理论概率。而有些失败，是我们一次也承受不起的。在一个漫长的多回合游戏里，不要只想着这一局。所以永远要留一些余量，多一些水、多一些体力、多一块电池、多一句提醒，不要满仓去赌山的阴晴。如果没打算挑战极限，那就不要随便试探极限。</p>\n</li>\n</ol>\n<p>祝你我知道代价，知道收益，知道一切皆为概率，然后享受每一个此时此刻。</p>\n<p>2026.01.20</p>\n<hr />\n<h2>Bonus内容：与AI一起创作</h2>\n<h3>DeepSeek</h3>\n<p>这篇关于哈巴雪山的回忆文章，包含了丰富的亲身经历与实用细节。以下是对其中<strong>实用性信息</strong>及<strong>经验教训</strong>的整理总结：</p>\n<hr />\n<h4>一、实用信息与经验总结</h4>\n<h5>1. <strong>行程安排</strong></h5>\n<ul>\n<li><strong>时间紧凑</strong>：若行程压缩为两天一夜（丽江—哈巴村—大本营—冲顶—返回），会缺少海拔适应时间，建议尽量安排休整日。</li>\n<li><strong>交通方式</strong>：</li>\n<li>香港直飞丽江有时有低价机票（如香港航空HK412）。</li>\n<li>从哈巴村到大本营可选择骑骡子（节省体力，适合紧凑行程或天气差时），徒步则更辛苦。</li>\n<li><strong>关键时间点</strong>：</li>\n<li>冲顶一般凌晨3点出发，需提前整理装备，尽早休息。</li>\n<li>下山后尽早返回丽江，避免夜间行车。</li>\n</ul>\n<h5>2. <strong>行前准备</strong></h5>\n<ul>\n<li><strong>物资准备</strong>：</li>\n<li>建议提前列清单，利用淘宝、实体店等多渠道采购。</li>\n<li>若遇天气风险（如台风），可将物资直接寄往丽江酒店代收（提前与酒店沟通）。</li>\n<li>物资宁可多备，关键装备（防水衣物、冰爪等）必须确保。</li>\n<li><strong>体能训练</strong>：</li>\n<li>短期训练可重点练爬楼梯（每次约100层，300米爬升），模拟高原爬升。</li>\n<li>训练期间注意膝盖保护，避免受伤。</li>\n<li>保证充足睡眠，行前尽量调整作息。</li>\n<li><strong>项目管理</strong>：</li>\n<li>可用看板工具（如obsidian）跟踪物资与行程。</li>\n<li>与队友保持密切沟通，明确分工。</li>\n</ul>\n<h5>3. <strong>装备经验</strong></h5>\n<ul>\n<li><strong>必要装备</strong>：</li>\n<li><strong>雨衣</strong>：长摆防雨衣（如迪卡侬款）很重要，尤其在持续雨雪中可作为最外层。</li>\n<li><strong>冰爪</strong>：专业长齿冰爪在冰雪碎石坡必不可少，但需注意两脚交叠可能卡住摔倒。</li>\n<li><strong>冰镐</strong>：用于上坡借力、雪坡制动，任何时候不要离手。</li>\n<li><strong>安全绳/安全带</strong>：实际冲顶时协作可能不强制使用，但险段（如陡坡下降）仍有必要。</li>\n<li><strong>衣物分层</strong>：<ul>\n<li>上身：速干衣→抓绒→排骨羽绒→冲锋衣→雨衣</li>\n<li>下身：速干裤→抓绒→冲锋裤→雪套</li>\n<li>手部：薄防水手套+厚滑雪手套备用</li>\n<li>脚部：两双厚袜+高帮防水登山鞋+冰爪，可考虑套保鲜膜增强防水</li>\n</ul>\n</li>\n<li><strong>保温杯</strong>：务必拴紧在背包上，防止滑落。</li>\n<li><strong>大本营情况</strong>：</li>\n<li>住宿较简陋（多人间，有电但网络差）。</li>\n<li>地面在雨季泥泞难行，建议穿防滑耐脏的鞋子。</li>\n<li>食堂伙食不错，厕所为旱厕，需有心理准备。</li>\n</ul>\n<h5>4. <strong>高反与健康管理</strong></h5>\n<ul>\n<li><strong>预防与缓解</strong>：</li>\n<li>多喝水帮助代谢，但睡前酌量，避免频繁起夜。</li>\n<li>抵达高原后尽量休息，避免剧烈活动。</li>\n<li>头痛是常见症状，不必过度焦虑，可缓慢适应。</li>\n<li><strong>冲顶当日</strong>：</li>\n<li>即使状态差、没食欲，也要强迫进食（如粥、咸菜）。</li>\n<li>及时增减衣物，防止失温（如在4500米处加穿羽绒服）。</li>\n<li>带足热水、能量饮料（如红牛）和 snacks。</li>\n<li><strong>下山后</strong>：</li>\n<li>及时更换湿袜子，防止冻伤。</li>\n<li>注意肠胃反应（呕吐、腹泻）可能是高反表现，可备达喜等药物。</li>\n</ul>\n<h5>5. <strong>冲顶与下山技巧</strong></h5>\n<ul>\n<li><strong>上山</strong>：</li>\n<li>保持自己的节奏，不必强跟他人。</li>\n<li>碎石坡段可利用冰爪直接踩石上行，注意落脚稳定。</li>\n<li>绝望坡（雪坡）用“拜年式”步法：冰镐插入前方→踢雪站稳→重心前移。</li>\n<li><strong>下山</strong>：</li>\n<li>雪坡下降时重心稍后，眼睛看远处而非脚下，减少滑倒。</li>\n<li>登山杖在非技术路段可大幅节省体力、保护膝盖。</li>\n<li>膝盖旧伤者尤其注意下山速度，避免奔跑或跳跃。</li>\n<li><strong>安全要点</strong>：</li>\n<li>听从协作指导，但也要保持自我判断。</li>\n<li>危险路段务必连接路绳。</li>\n<li>天气差时（大风雪、低能见度）下撤并不可耻。</li>\n</ul>\n<h5>6. <strong>其他实用贴士</strong></h5>\n<ul>\n<li><strong>手机与通讯</strong>：大本营无移动信号，WiFi不稳定，做好失联准备。</li>\n<li><strong>骡子下山</strong>：脚部长时间不动易冻伤，尽量保持活动或提前加热水袋。</li>\n<li><strong>行李整理</strong>：冲顶包尽量轻量化，非必要物品放大本营。</li>\n<li><strong>环保意识</strong>：带走自己的垃圾，保持营地清洁。</li>\n</ul>\n<hr />\n<h4>二、核心经验教训</h4>\n<ol>\n<li>\n<p><strong>物资宁可多备，关键装备不能省</strong><br />\n   雨衣、冰爪、防水手套等在一次恶劣天气中就能决定成败，不要因体积或重量犹豫。</p>\n</li>\n<li>\n<p><strong>高原适应很重要</strong><br />\n   尽量安排时间在哈巴村或大本营适应海拔，避免直上直下引发严重高反。</p>\n</li>\n<li>\n<p><strong>不要轻视天气影响</strong><br />\n   连续雨雪会让路线难度大增，并增加失温风险，做好防雨防雪全套准备。</p>\n</li>\n<li>\n<p><strong>体能分配比绝对体能更重要</strong><br />\n   上山保留体力，下山更需谨慎——很多人是在下山时受伤或出现状况。</p>\n</li>\n<li>\n<p><strong>协作是帮手，但自己才是安全第一责任人</strong><br />\n   熟悉装备用法，了解路线风险，即使协作鼓励也要量力而行。</p>\n</li>\n<li>\n<p><strong>心理准备有时比生理准备更重要</strong><br />\n   登山是持久战，接受痛苦、模糊与不确定性，专注“下一步”而非终点。</p>\n</li>\n<li>\n<p><strong>行动优于空等“完美时机”</strong><br />\n   准备永远没有“完全充分”的时候，合理评估风险后就出发，通过行动积累经验。</p>\n</li>\n</ol>\n<hr />\n<h4>三、适合人群</h4>\n<ul>\n<li>计划首次攀登5000米级雪山的爱好者</li>\n<li>注重实战经验与风险管理的户外玩家</li>\n<li>希望了解高原登山细节与装备选择的徒步者</li>\n</ul>\n<hr />\n<h3>Gemini-3-Pro</h3>\n<p>这是一篇非常详实且充满个人体验的登山回忆录。作者在极度压缩的行程（两天一夜）和恶劣天气（台风外围影响、雨雪）下成功登顶哈巴雪山，其中包含了很多宝贵的实战经验和教训。</p>\n<p>为了让你更直观地获取其中的实用信息，我将其整理为一个“哈巴雪山速攀实战复盘可视化大屏”。这个HTML页面包含了行程分析、装备红黑榜、体能准备及关键经验教训。</p>\n<h4>可视化总结说明</h4>\n<ol>\n<li><strong>行程与海拔概览</strong>：直观展示了“特种兵式”的2天1夜行程，强调了海拔快速爬升带来的风险。</li>\n<li><strong>装备实战评测</strong>：根据文中描述，将装备分为“黑马（意想不到的好用）”、“核心（必须有）”和“教训（需改进）”三类。</li>\n<li><strong>关键路段解析</strong>：拆解了“碎石坡”和“绝望坡”的通过难点。</li>\n<li><strong>经验与教训</strong>：提炼了关于高反、物流、身体护理等实用建议。</li>\n</ol>\n<p>你可以将以下代码保存为 <code>.html</code> 文件在浏览器中打开，或者直接查看渲染后的布局思路。</p>\n<p><em>(为适应平台显示，已手动将html转为图片)</em></p>\n<p><img alt=\"哈巴雪山速攀实战复盘可视化大屏\" src=\"assets/images/gemini-summary.png\" /></p>",
    "date": "2026-01-20"
  }
]